Revit 2026 API

# GeometryObject Methods

---

The GeometryObject type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject) |
|  | Equals | Determines whether the specified Object is equal to the current Object. (Overrides ObjectEquals(Object)) |
|  | GetHashCode | Gets the integer value of the geometry object as hash code (Overrides ObjectGetHashCode) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

GeometryObject Class

Autodesk.Revit.DB Namespace